# 1. + ოპერატორი
a = 5
a += 1
a += 2
a += 3
a += 4
a += 5
a += 6
a += 7
a += 8
a += 9
a += 10

# 2. - ოპერატორი
b = 50
b -= 1
b -= 2
b -= 3
b -= 4
b -= 5
b -= 6
b -= 7
b -= 8
b -= 9
b -= 10

# 3. * ოპერატორი
c = 2
c *= 1
c *= 2
c *= 3
c *= 4
c *= 5
c *= 6
c *= 7
c *= 8
c *= 9
c *= 10

# 4. / ოპერატორი
d = 1000
d /= 2
d /= 2
d /= 2
d /= 2
d /= 2
d /= 2
d /= 2
d /= 2
d /= 2
d /= 2

# 5. % ოპერატორი
e = 100
e %= 30
e %= 20
e %= 10
e %= 5
e %= 3
e %= 2
e %= 1
e %= 1
e %= 1
e %= 1

# 6. ** ოპერატორი 
f = 2
f **= 2
f **= 2
f **= 2
f **= 2
f **= 2
f **= 2
f **= 2
f **= 2
f **= 2
f **= 2
